[NoCoverage] BlockStatement
src/controllers/auth.controller.js:4:36
 const { registrarUsuario,autenticarUsuario } = require('../services/auth.service');
 const erros = require('../utils/errors');
 
-async function registrar(req, res) {
-    try {
-        const { nome, email, senha, perfil } = req.body;
-        if (!nome || !email || !senha || !perfil) {
-            return res.status(400).json(erros.CAMPOS_OBRIGATORIOS);
-        }
-        const usuario = await registrarUsuario({ nome, email, senha, perfil });
-        const { senha: _, ...usuarioSemSenha } = usuario.toObject();
-        return res.status(201).json(usuarioSemSenha);
-    }catch (error) {
-        if (error.code === 11000) { 
-            return res.status(400).json(erros.EMAIL_DUPLICADO);
-        }
-        res.status(500).json(erros.ERRO_INTERNO);
-    }
-}
+async function registrar(req, res) {}
 async function autenticar(req, res) {
     try {

[NoCoverage] BlockStatement
src/controllers/auth.controller.js:5:9
 const erros = require('../utils/errors');
 
 async function registrar(req, res) {
-    try {
-        const { nome, email, senha, perfil } = req.body;
-        if (!nome || !email || !senha || !perfil) {
-            return res.status(400).json(erros.CAMPOS_OBRIGATORIOS);
-        }
-        const usuario = await registrarUsuario({ nome, email, senha, perfil });
-        const { senha: _, ...usuarioSemSenha } = usuario.toObject();
-        return res.status(201).json(usuarioSemSenha);
-    }catch (error) {
+    try {}catch (error) {
         if (error.code === 11000) { 
             return res.status(400).json(erros.EMAIL_DUPLICADO);

[NoCoverage] LogicalOperator
src/controllers/auth.controller.js:7:13
 async function registrar(req, res) {
     try {
         const { nome, email, senha, perfil } = req.body;
-        if (!nome || !email || !senha || !perfil) {
+        if ((!nome || !email || !senha) && !perfil) {
             return res.status(400).json(erros.CAMPOS_OBRIGATORIOS);
         }

[NoCoverage] BooleanLiteral
src/controllers/auth.controller.js:7:42
 async function registrar(req, res) {
     try {
         const { nome, email, senha, perfil } = req.body;
-        if (!nome || !email || !senha || !perfil) {
+        if (!nome || !email || !senha || perfil) {
             return res.status(400).json(erros.CAMPOS_OBRIGATORIOS);
         }

[NoCoverage] ObjectLiteral
src/controllers/auth.controller.js:10:48
         if (!nome || !email || !senha || !perfil) {
             return res.status(400).json(erros.CAMPOS_OBRIGATORIOS);
         }
-        const usuario = await registrarUsuario({ nome, email, senha, perfil });
+        const usuario = await registrarUsuario({});
         const { senha: _, ...usuarioSemSenha } = usuario.toObject();
         return res.status(201).json(usuarioSemSenha);

[NoCoverage] BlockStatement
src/controllers/auth.controller.js:13:20
         const usuario = await registrarUsuario({ nome, email, senha, perfil });
         const { senha: _, ...usuarioSemSenha } = usuario.toObject();
         return res.status(201).json(usuarioSemSenha);
-    }catch (error) {
-        if (error.code === 11000) { 
-            return res.status(400).json(erros.EMAIL_DUPLICADO);
-        }
-        res.status(500).json(erros.ERRO_INTERNO);
-    }
+    }catch (error) {}
 }
 async function autenticar(req, res) {

[NoCoverage] ConditionalExpression
src/controllers/auth.controller.js:14:13
         const { senha: _, ...usuarioSemSenha } = usuario.toObject();
         return res.status(201).json(usuarioSemSenha);
     }catch (error) {
-        if (error.code === 11000) { 
+        if (false) { 
             return res.status(400).json(erros.EMAIL_DUPLICADO);
         }

[NoCoverage] BlockStatement
src/controllers/auth.controller.js:14:35
         const { senha: _, ...usuarioSemSenha } = usuario.toObject();
         return res.status(201).json(usuarioSemSenha);
     }catch (error) {
-        if (error.code === 11000) { 
-            return res.status(400).json(erros.EMAIL_DUPLICADO);
-        }
+        if (error.code === 11000) {}
         res.status(500).json(erros.ERRO_INTERNO);
     }

[NoCoverage] BlockStatement
src/controllers/auth.controller.js:20:37
         res.status(500).json(erros.ERRO_INTERNO);
     }
 }
-async function autenticar(req, res) {
-    try {
-        const { email, senha } = req.body;
-        if (!email || !senha) {
-            return res.status(400).json(erros.CAMPOS_OBRIGATORIOS);
-        }
-        const { token } = await autenticarUsuario(email, senha);
-        return res.status(200).json({ token });
-    } catch (error) {
-        if (error.message === 'Usuário não encontrado') {
-            return res.status(404).json(erros.USUARIO_NAO_ENCONTRADO);
-        }
-        if (error.message === 'Senha inválida') {
-            return res.status(401).json(erros.LOGIN_INVALIDO);
-        }
-        res.status(500).json(erros.ERRO_INTERNO);
-    }
-}
+async function autenticar(req, res) {}
 module.exports = {
     registrar,

[NoCoverage] BlockStatement
src/controllers/auth.controller.js:21:9
     }
 }
 async function autenticar(req, res) {
-    try {
-        const { email, senha } = req.body;
-        if (!email || !senha) {
-            return res.status(400).json(erros.CAMPOS_OBRIGATORIOS);
-        }
-        const { token } = await autenticarUsuario(email, senha);
-        return res.status(200).json({ token });
-    } catch (error) {
+    try {} catch (error) {
         if (error.message === 'Usuário não encontrado') {
             return res.status(404).json(erros.USUARIO_NAO_ENCONTRADO);

[NoCoverage] BlockStatement
src/controllers/auth.controller.js:23:31
 async function autenticar(req, res) {
     try {
         const { email, senha } = req.body;
-        if (!email || !senha) {
-            return res.status(400).json(erros.CAMPOS_OBRIGATORIOS);
-        }
+        if (!email || !senha) {}
         const { token } = await autenticarUsuario(email, senha);
         return res.status(200).json({ token });

[NoCoverage] ConditionalExpression
src/controllers/auth.controller.js:23:13
 async function autenticar(req, res) {
     try {
         const { email, senha } = req.body;
-        if (!email || !senha) {
+        if (true) {
             return res.status(400).json(erros.CAMPOS_OBRIGATORIOS);
         }

[NoCoverage] ObjectLiteral
src/controllers/auth.controller.js:27:37
             return res.status(400).json(erros.CAMPOS_OBRIGATORIOS);
         }
         const { token } = await autenticarUsuario(email, senha);
-        return res.status(200).json({ token });
+        return res.status(200).json({});
     } catch (error) {
         if (error.message === 'Usuário não encontrado') {

[NoCoverage] BlockStatement
src/controllers/auth.controller.js:28:21
         }
         const { token } = await autenticarUsuario(email, senha);
         return res.status(200).json({ token });
-    } catch (error) {
-        if (error.message === 'Usuário não encontrado') {
-            return res.status(404).json(erros.USUARIO_NAO_ENCONTRADO);
-        }
-        if (error.message === 'Senha inválida') {
-            return res.status(401).json(erros.LOGIN_INVALIDO);
-        }
-        res.status(500).json(erros.ERRO_INTERNO);
-    }
+    } catch (error) {}
 }
 module.exports = {

[NoCoverage] ConditionalExpression
src/controllers/auth.controller.js:29:13
         const { token } = await autenticarUsuario(email, senha);
         return res.status(200).json({ token });
     } catch (error) {
-        if (error.message === 'Usuário não encontrado') {
+        if (true) {
             return res.status(404).json(erros.USUARIO_NAO_ENCONTRADO);
         }

[NoCoverage] ConditionalExpression
src/controllers/auth.controller.js:29:13
         const { token } = await autenticarUsuario(email, senha);
         return res.status(200).json({ token });
     } catch (error) {
-        if (error.message === 'Usuário não encontrado') {
+        if (false) {
             return res.status(404).json(erros.USUARIO_NAO_ENCONTRADO);
         }

[NoCoverage] EqualityOperator
src/controllers/auth.controller.js:32:13
         if (error.message === 'Usuário não encontrado') {
             return res.status(404).json(erros.USUARIO_NAO_ENCONTRADO);
         }
-        if (error.message === 'Senha inválida') {
+        if (error.message !== 'Senha inválida') {
             return res.status(401).json(erros.LOGIN_INVALIDO);
         }

[NoCoverage] BlockStatement
src/controllers/auth.controller.js:32:49
         if (error.message === 'Usuário não encontrado') {
             return res.status(404).json(erros.USUARIO_NAO_ENCONTRADO);
         }
-        if (error.message === 'Senha inválida') {
-            return res.status(401).json(erros.LOGIN_INVALIDO);
-        }
+        if (error.message === 'Senha inválida') {}
         res.status(500).json(erros.ERRO_INTERNO);
     }

[NoCoverage] ObjectLiteral
src/controllers/auth.controller.js:38:18
         res.status(500).json(erros.ERRO_INTERNO);
     }
 }
-module.exports = {
-    registrar,
-    autenticar
-};
+module.exports = {};
