[NoCoverage] BlockStatement
src/app.js:13:34
 app.use(cors());
 app.use(express.json());
 app.use('/api-docs', swaggerUi.serve, swaggerUi.setup(swaggerSpec));
-app.get('/health', (req, res) => {
-  res.status(200).json({ status: 'health ok' });
-});
+app.get('/health', (req, res) => {});
 app.use(contarRequisicao);
 app.get('/metrics', async (req, res) => {

[NoCoverage] StringLiteral
src/app.js:14:34
 app.use(express.json());
 app.use('/api-docs', swaggerUi.serve, swaggerUi.setup(swaggerSpec));
 app.get('/health', (req, res) => {
-  res.status(200).json({ status: 'health ok' });
+  res.status(200).json({ status: "" });
 });
 app.use(contarRequisicao);

[NoCoverage] BlockStatement
src/app.js:17:41
   res.status(200).json({ status: 'health ok' });
 });
 app.use(contarRequisicao);
-app.get('/metrics', async (req, res) => {
-  res.set('Content-Type', metricsRegistry.contentType);
-  res.end(await metricsRegistry.metrics());
-});
+app.get('/metrics', async (req, res) => {});
 
 app.use('/api/auth', authRoutes);

[NoCoverage] StringLiteral
src/app.js:17:9
   res.status(200).json({ status: 'health ok' });
 });
 app.use(contarRequisicao);
-app.get('/metrics', async (req, res) => {
+app.get("", async (req, res) => {
   res.set('Content-Type', metricsRegistry.contentType);
   res.end(await metricsRegistry.metrics());

[NoCoverage] StringLiteral
src/app.js:18:11
 });
 app.use(contarRequisicao);
 app.get('/metrics', async (req, res) => {
-  res.set('Content-Type', metricsRegistry.contentType);
+  res.set("", metricsRegistry.contentType);
   res.end(await metricsRegistry.metrics());
 });

[NoCoverage] StringLiteral
src/app.js:23:9
 });
 
 app.use('/api/auth', authRoutes);
-app.use('/api', postRoutes);
+app.use("", postRoutes);
 
 module.exports = app;
