[NoCoverage] BlockStatement
src/middlewares/authMiddleware.js:7:42
 
 const SECRET = process.env.JWT_SECRET;
 
-function autenticarToken(req, res, next) {
-    const authHeader = req.headers['authorization'];
-    const token = authHeader && authHeader.split(' ')[1];
-    if (!token) {
-        return res.status(401).json(erros.TOKEN_NAO_FORNECIDO);
-    }
-    jwt.verify(token, SECRET, (err, usuario) => {
-        if (err) {
-            return res.status(403).json(erros.TOKEN_INVALIDO);
-        }
-
-        req.usuario = usuario;
-        next();
-    });
-}
+function autenticarToken(req, res, next) {}
 
 module.exports = autenticarToken;

[NoCoverage] LogicalOperator
src/middlewares/authMiddleware.js:9:19
 
 function autenticarToken(req, res, next) {
     const authHeader = req.headers['authorization'];
-    const token = authHeader && authHeader.split(' ')[1];
+    const token = authHeader || authHeader.split(' ')[1];
     if (!token) {
         return res.status(401).json(erros.TOKEN_NAO_FORNECIDO);

[NoCoverage] ConditionalExpression
src/middlewares/authMiddleware.js:9:19
 
 function autenticarToken(req, res, next) {
     const authHeader = req.headers['authorization'];
-    const token = authHeader && authHeader.split(' ')[1];
+    const token = false;
     if (!token) {
         return res.status(401).json(erros.TOKEN_NAO_FORNECIDO);

[NoCoverage] BlockStatement
src/middlewares/authMiddleware.js:10:17
 function autenticarToken(req, res, next) {
     const authHeader = req.headers['authorization'];
     const token = authHeader && authHeader.split(' ')[1];
-    if (!token) {
-        return res.status(401).json(erros.TOKEN_NAO_FORNECIDO);
-    }
+    if (!token) {}
     jwt.verify(token, SECRET, (err, usuario) => {
         if (err) {

[NoCoverage] BooleanLiteral
src/middlewares/authMiddleware.js:10:9
 function autenticarToken(req, res, next) {
     const authHeader = req.headers['authorization'];
     const token = authHeader && authHeader.split(' ')[1];
-    if (!token) {
+    if (token) {
         return res.status(401).json(erros.TOKEN_NAO_FORNECIDO);
     }

[NoCoverage] BlockStatement
src/middlewares/authMiddleware.js:13:49
     if (!token) {
         return res.status(401).json(erros.TOKEN_NAO_FORNECIDO);
     }
-    jwt.verify(token, SECRET, (err, usuario) => {
-        if (err) {
-            return res.status(403).json(erros.TOKEN_INVALIDO);
-        }
-
-        req.usuario = usuario;
-        next();
-    });
+    jwt.verify(token, SECRET, (err, usuario) => {});
 }
 

[NoCoverage] ConditionalExpression
src/middlewares/authMiddleware.js:14:13
         return res.status(401).json(erros.TOKEN_NAO_FORNECIDO);
     }
     jwt.verify(token, SECRET, (err, usuario) => {
-        if (err) {
+        if (false) {
             return res.status(403).json(erros.TOKEN_INVALIDO);
         }

[NoCoverage] BlockStatement
src/middlewares/authMiddleware.js:14:18
         return res.status(401).json(erros.TOKEN_NAO_FORNECIDO);
     }
     jwt.verify(token, SECRET, (err, usuario) => {
-        if (err) {
-            return res.status(403).json(erros.TOKEN_INVALIDO);
-        }
+        if (err) {}
 
         req.usuario = usuario;
