[NoCoverage] LogicalOperator
src/config/database.js:4:19
 const mongoose = require('mongoose');
 require('dotenv').config();
 
-const MONGO_URI = process.env.MONGO_URI_PROD || process.env.MONGO_URI_DOCKER || process.env.MONGO_URI_LOCAL;
+const MONGO_URI = (process.env.MONGO_URI_PROD || process.env.MONGO_URI_DOCKER) && process.env.MONGO_URI_LOCAL;
 async function connectToDatabase() {
     try {

[NoCoverage] ConditionalExpression
src/config/database.js:4:19
 const mongoose = require('mongoose');
 require('dotenv').config();
 
-const MONGO_URI = process.env.MONGO_URI_PROD || process.env.MONGO_URI_DOCKER || process.env.MONGO_URI_LOCAL;
+const MONGO_URI = false;
 async function connectToDatabase() {
     try {

[NoCoverage] BlockStatement
src/config/database.js:5:36
 require('dotenv').config();
 
 const MONGO_URI = process.env.MONGO_URI_PROD || process.env.MONGO_URI_DOCKER || process.env.MONGO_URI_LOCAL;
-async function connectToDatabase() {
-    try {
-        if (!MONGO_URI) throw new Error("MONGO_URI não definida");
-        await mongoose.connect(MONGO_URI);
-        console.log('Conectado ao MongoDB com sucesso!');
-    } catch (error) {
-        console.error('Erro ao conectar ao MongoDB:', error);
-        process.exit(1);
-    }
-}
+async function connectToDatabase() {}
 
 module.exports = connectToDatabase;

[NoCoverage] BlockStatement
src/config/database.js:6:9
 
 const MONGO_URI = process.env.MONGO_URI_PROD || process.env.MONGO_URI_DOCKER || process.env.MONGO_URI_LOCAL;
 async function connectToDatabase() {
-    try {
-        if (!MONGO_URI) throw new Error("MONGO_URI não definida");
-        await mongoose.connect(MONGO_URI);
-        console.log('Conectado ao MongoDB com sucesso!');
-    } catch (error) {
+    try {} catch (error) {
         console.error('Erro ao conectar ao MongoDB:', error);
         process.exit(1);

[NoCoverage] BooleanLiteral
src/config/database.js:7:13
 const MONGO_URI = process.env.MONGO_URI_PROD || process.env.MONGO_URI_DOCKER || process.env.MONGO_URI_LOCAL;
 async function connectToDatabase() {
     try {
-        if (!MONGO_URI) throw new Error("MONGO_URI não definida");
+        if (MONGO_URI) throw new Error("MONGO_URI não definida");
         await mongoose.connect(MONGO_URI);
         console.log('Conectado ao MongoDB com sucesso!');

[NoCoverage] ConditionalExpression
src/config/database.js:7:13
 const MONGO_URI = process.env.MONGO_URI_PROD || process.env.MONGO_URI_DOCKER || process.env.MONGO_URI_LOCAL;
 async function connectToDatabase() {
     try {
-        if (!MONGO_URI) throw new Error("MONGO_URI não definida");
+        if (true) throw new Error("MONGO_URI não definida");
         await mongoose.connect(MONGO_URI);
         console.log('Conectado ao MongoDB com sucesso!');

[NoCoverage] BlockStatement
src/config/database.js:10:21
         if (!MONGO_URI) throw new Error("MONGO_URI não definida");
         await mongoose.connect(MONGO_URI);
         console.log('Conectado ao MongoDB com sucesso!');
-    } catch (error) {
-        console.error('Erro ao conectar ao MongoDB:', error);
-        process.exit(1);
-    }
+    } catch (error) {}
 }
 
