[NoCoverage] StringLiteral
src/config/swagger.js:9:26
         info: {
             title: 'TechBlog API',
             version: '1.0.0',
-            description: 'API para gerenciamento de postagens no blog',
+            description: "",
         },
         servers: [

[NoCoverage] ArrayDeclaration
src/config/swagger.js:11:18
             version: '1.0.0',
             description: 'API para gerenciamento de postagens no blog',
         },
-        servers: [
-            {
-                url: 'http://localhost:3000/api',
-            },
-        ],
+        servers: [],
         components: {
             securitySchemes: {

[NoCoverage] ObjectLiteral
src/config/swagger.js:12:13
             description: 'API para gerenciamento de postagens no blog',
         },
         servers: [
-            {
-                url: 'http://localhost:3000/api',
-            },
+            {},
         ],
         components: {

[NoCoverage] ObjectLiteral
src/config/swagger.js:17:30
             },
         ],
         components: {
-            securitySchemes: {
-                bearerAuth: {
-                    type: 'http',
-                    scheme: 'bearer',
-                    bearerFormat: 'JWT',
-                },
-            },
+            securitySchemes: {},
         },
         security: [

[NoCoverage] ObjectLiteral
src/config/swagger.js:18:29
         ],
         components: {
             securitySchemes: {
-                bearerAuth: {
-                    type: 'http',
-                    scheme: 'bearer',
-                    bearerFormat: 'JWT',
-                },
+                bearerAuth: {},
             },
         },

[NoCoverage] StringLiteral
src/config/swagger.js:19:27
         components: {
             securitySchemes: {
                 bearerAuth: {
-                    type: 'http',
+                    type: "",
                     scheme: 'bearer',
                     bearerFormat: 'JWT',

[NoCoverage] ArrayDeclaration
src/config/swagger.js:27:29
         },
         security: [
             {
-                bearerAuth: [],
+                bearerAuth: ["Stryker was here"],
             },
         ],
