[NoCoverage] BlockStatement
src/services/auth.service.js:12:65
 
 const SECRET = process.env.JWT_SECRET
 
-async function registrarUsuario({ nome, email, senha, perfil }) {
-    try {
-        const senhaCriptografada = await bcrypt.hash(senha, SALT_ROUNDS);
-        const novoUsuario = await User.create({ nome, email, senha: senhaCriptografada, perfil });
-        return novoUsuario;
-    } catch (error) {
-        console.error('Erro ao registrar usuário:', error.message);
-        throw error;
-    }
-}
+async function registrarUsuario({ nome, email, senha, perfil }) {}
 
 async function autenticarUsuario(email, senha) {

[NoCoverage] BlockStatement
src/services/auth.service.js:13:9
 const SECRET = process.env.JWT_SECRET
 
 async function registrarUsuario({ nome, email, senha, perfil }) {
-    try {
-        const senhaCriptografada = await bcrypt.hash(senha, SALT_ROUNDS);
-        const novoUsuario = await User.create({ nome, email, senha: senhaCriptografada, perfil });
-        return novoUsuario;
-    } catch (error) {
+    try {} catch (error) {
         console.error('Erro ao registrar usuário:', error.message);
         throw error;

[NoCoverage] ObjectLiteral
src/services/auth.service.js:15:47
 async function registrarUsuario({ nome, email, senha, perfil }) {
     try {
         const senhaCriptografada = await bcrypt.hash(senha, SALT_ROUNDS);
-        const novoUsuario = await User.create({ nome, email, senha: senhaCriptografada, perfil });
+        const novoUsuario = await User.create({});
         return novoUsuario;
     } catch (error) {

[NoCoverage] BlockStatement
src/services/auth.service.js:17:21
         const senhaCriptografada = await bcrypt.hash(senha, SALT_ROUNDS);
         const novoUsuario = await User.create({ nome, email, senha: senhaCriptografada, perfil });
         return novoUsuario;
-    } catch (error) {
-        console.error('Erro ao registrar usuário:', error.message);
-        throw error;
-    }
+    } catch (error) {}
 }
 

[NoCoverage] StringLiteral
src/services/auth.service.js:18:23
         const novoUsuario = await User.create({ nome, email, senha: senhaCriptografada, perfil });
         return novoUsuario;
     } catch (error) {
-        console.error('Erro ao registrar usuário:', error.message);
+        console.error("", error.message);
         throw error;
     }

[NoCoverage] BlockStatement
src/services/auth.service.js:23:48
     }
 }
 
-async function autenticarUsuario(email, senha) {
-    try {
-        const usuario = await User.findOne({ email });
-        if (!usuario) {
-            throw new Error('Usuário não encontrado');
-        }
-        const senhaValida = await bcrypt.compare(senha, usuario.senha);
-        if (!senhaValida) {
-            throw new Error('Senha inválida');
-        }
-        const token = jwt.sign({ id: usuario._id, perfil: usuario.perfil, email: usuario.email }, SECRET, { expiresIn: '1h' });
-
-        return { token };
-    } catch (error) {
-        console.error('Erro ao autenticar usuário:', error.message);
-        throw error;
-    }
-}
+async function autenticarUsuario(email, senha) {}
 
 module.exports = {

[NoCoverage] BlockStatement
src/services/auth.service.js:24:9
 }
 
 async function autenticarUsuario(email, senha) {
-    try {
-        const usuario = await User.findOne({ email });
-        if (!usuario) {
-            throw new Error('Usuário não encontrado');
-        }
-        const senhaValida = await bcrypt.compare(senha, usuario.senha);
-        if (!senhaValida) {
-            throw new Error('Senha inválida');
-        }
-        const token = jwt.sign({ id: usuario._id, perfil: usuario.perfil, email: usuario.email }, SECRET, { expiresIn: '1h' });
-
-        return { token };
-    } catch (error) {
+    try {} catch (error) {
         console.error('Erro ao autenticar usuário:', error.message);
         throw error;

[NoCoverage] ConditionalExpression
src/services/auth.service.js:26:13
 async function autenticarUsuario(email, senha) {
     try {
         const usuario = await User.findOne({ email });
-        if (!usuario) {
+        if (true) {
             throw new Error('Usuário não encontrado');
         }

[NoCoverage] BlockStatement
src/services/auth.service.js:26:23
 async function autenticarUsuario(email, senha) {
     try {
         const usuario = await User.findOne({ email });
-        if (!usuario) {
-            throw new Error('Usuário não encontrado');
-        }
+        if (!usuario) {}
         const senhaValida = await bcrypt.compare(senha, usuario.senha);
         if (!senhaValida) {

[NoCoverage] ConditionalExpression
src/services/auth.service.js:30:13
             throw new Error('Usuário não encontrado');
         }
         const senhaValida = await bcrypt.compare(senha, usuario.senha);
-        if (!senhaValida) {
+        if (true) {
             throw new Error('Senha inválida');
         }

[NoCoverage] ConditionalExpression
src/services/auth.service.js:30:13
             throw new Error('Usuário não encontrado');
         }
         const senhaValida = await bcrypt.compare(senha, usuario.senha);
-        if (!senhaValida) {
+        if (false) {
             throw new Error('Senha inválida');
         }

[NoCoverage] ObjectLiteral
src/services/auth.service.js:33:32
         if (!senhaValida) {
             throw new Error('Senha inválida');
         }
-        const token = jwt.sign({ id: usuario._id, perfil: usuario.perfil, email: usuario.email }, SECRET, { expiresIn: '1h' });
+        const token = jwt.sign({}, SECRET, { expiresIn: '1h' });
 
         return { token };

[NoCoverage] BlockStatement
src/services/auth.service.js:36:21
         const token = jwt.sign({ id: usuario._id, perfil: usuario.perfil, email: usuario.email }, SECRET, { expiresIn: '1h' });
 
         return { token };
-    } catch (error) {
-        console.error('Erro ao autenticar usuário:', error.message);
-        throw error;
-    }
+    } catch (error) {}
 }
 

[NoCoverage] StringLiteral
src/services/auth.service.js:37:23
 
         return { token };
     } catch (error) {
-        console.error('Erro ao autenticar usuário:', error.message);
+        console.error("", error.message);
         throw error;
     }
