[NoCoverage] BlockStatement
src/controllers/post.controller.js:3:42
 const { getPostId, getAllPosts, createPost, deletePost, updatePost, searchPosts } = require('../services/post.service');
 
-async function listarPostPorId(req, res) {
-    try {
-        const { id } = req.params;
-        const post = await getPostId(id);
-        if (!post) {
-            return res.status(404).json(erros.POST_NAO_ENCONTRADO);
-        }
-        res.status(200).json(post);
-    }
-    catch (error) {
-        console.error('Erro ao buscar post por ID:', error.message);
-        res.status(500).json(erros.POST_ERRO_BUSCAR);
-    }
-}
+async function listarPostPorId(req, res) {}
 
 

[NoCoverage] BlockStatement
src/controllers/post.controller.js:4:9
 const { getPostId, getAllPosts, createPost, deletePost, updatePost, searchPosts } = require('../services/post.service');
 
 async function listarPostPorId(req, res) {
-    try {
-        const { id } = req.params;
-        const post = await getPostId(id);
-        if (!post) {
-            return res.status(404).json(erros.POST_NAO_ENCONTRADO);
-        }
-        res.status(200).json(post);
-    }
+    try {}
     catch (error) {
         console.error('Erro ao buscar post por ID:', error.message);

[NoCoverage] BlockStatement
src/controllers/post.controller.js:7:20
     try {
         const { id } = req.params;
         const post = await getPostId(id);
-        if (!post) {
-            return res.status(404).json(erros.POST_NAO_ENCONTRADO);
-        }
+        if (!post) {}
         res.status(200).json(post);
     }

[NoCoverage] ConditionalExpression
src/controllers/post.controller.js:7:13
     try {
         const { id } = req.params;
         const post = await getPostId(id);
-        if (!post) {
+        if (false) {
             return res.status(404).json(erros.POST_NAO_ENCONTRADO);
         }

[NoCoverage] BlockStatement
src/controllers/post.controller.js:12:19
         }
         res.status(200).json(post);
     }
-    catch (error) {
-        console.error('Erro ao buscar post por ID:', error.message);
-        res.status(500).json(erros.POST_ERRO_BUSCAR);
-    }
+    catch (error) {}
 }
 

[NoCoverage] BlockStatement
src/controllers/post.controller.js:19:38
 }
 
 
-async function listarPosts(req, res) {
-    try {
-        const posts = await getAllPosts();
-        res.status(200).json(posts);
-    } catch (error) {
-        console.error('Erro ao buscar posts:', error.message);
-        res.status(500).json(erros.POST_ERRO_LISTAR);
-    }
-}
+async function listarPosts(req, res) {}
 
 async function criarPost(req, res) {

[NoCoverage] BlockStatement
src/controllers/post.controller.js:20:9
 
 
 async function listarPosts(req, res) {
-    try {
-        const posts = await getAllPosts();
-        res.status(200).json(posts);
-    } catch (error) {
+    try {} catch (error) {
         console.error('Erro ao buscar posts:', error.message);
         res.status(500).json(erros.POST_ERRO_LISTAR);

[NoCoverage] BlockStatement
src/controllers/post.controller.js:23:21
     try {
         const posts = await getAllPosts();
         res.status(200).json(posts);
-    } catch (error) {
-        console.error('Erro ao buscar posts:', error.message);
-        res.status(500).json(erros.POST_ERRO_LISTAR);
-    }
+    } catch (error) {}
 }
 

[NoCoverage] StringLiteral
src/controllers/post.controller.js:24:23
         const posts = await getAllPosts();
         res.status(200).json(posts);
     } catch (error) {
-        console.error('Erro ao buscar posts:', error.message);
+        console.error("", error.message);
         res.status(500).json(erros.POST_ERRO_LISTAR);
     }

[NoCoverage] BlockStatement
src/controllers/post.controller.js:29:36
     }
 }
 
-async function criarPost(req, res) {
-    try {
-        const dados = req.body;
-        const novoPost = await createPost(dados);
-        res.status(201).json(novoPost);
-    } catch (error) {
-        console.error('Erro ao criar post:', error.message);
-        res.status(500).json(erros.POST_ERRO_CRIAR);
-    }
-}
+async function criarPost(req, res) {}
 
 async function atualizarPost(req, res) {

[NoCoverage] BlockStatement
src/controllers/post.controller.js:30:9
 }
 
 async function criarPost(req, res) {
-    try {
-        const dados = req.body;
-        const novoPost = await createPost(dados);
-        res.status(201).json(novoPost);
-    } catch (error) {
+    try {} catch (error) {
         console.error('Erro ao criar post:', error.message);
         res.status(500).json(erros.POST_ERRO_CRIAR);

[NoCoverage] BlockStatement
src/controllers/post.controller.js:34:21
         const dados = req.body;
         const novoPost = await createPost(dados);
         res.status(201).json(novoPost);
-    } catch (error) {
-        console.error('Erro ao criar post:', error.message);
-        res.status(500).json(erros.POST_ERRO_CRIAR);
-    }
+    } catch (error) {}
 }
 

[NoCoverage] BlockStatement
src/controllers/post.controller.js:40:40
     }
 }
 
-async function atualizarPost(req, res) {
-    try {
-        const { id } = req.params;
-        const dadosAtualizados = req.body;
-        const postAtualizado = await updatePost(id, dadosAtualizados);
-        if (!postAtualizado) {
-            return res.status(404).json(erros.POST_NAO_ENCONTRADO);
-        }
-        res.status(200).json(postAtualizado);
-    }
-    catch (error) {
-        console.error('Erro ao atualizar post:', error.message);
-        res.status(500).json(erros.POST_ERRO_ATUALIZAR);
-    }
-}
+async function atualizarPost(req, res) {}
 
 async function deletarPost(req, res) {

[NoCoverage] BlockStatement
src/controllers/post.controller.js:41:9
 }
 
 async function atualizarPost(req, res) {
-    try {
-        const { id } = req.params;
-        const dadosAtualizados = req.body;
-        const postAtualizado = await updatePost(id, dadosAtualizados);
-        if (!postAtualizado) {
-            return res.status(404).json(erros.POST_NAO_ENCONTRADO);
-        }
-        res.status(200).json(postAtualizado);
-    }
+    try {}
     catch (error) {
         console.error('Erro ao atualizar post:', error.message);

[NoCoverage] BlockStatement
src/controllers/post.controller.js:45:30
         const { id } = req.params;
         const dadosAtualizados = req.body;
         const postAtualizado = await updatePost(id, dadosAtualizados);
-        if (!postAtualizado) {
-            return res.status(404).json(erros.POST_NAO_ENCONTRADO);
-        }
+        if (!postAtualizado) {}
         res.status(200).json(postAtualizado);
     }

[NoCoverage] BooleanLiteral
src/controllers/post.controller.js:45:13
         const { id } = req.params;
         const dadosAtualizados = req.body;
         const postAtualizado = await updatePost(id, dadosAtualizados);
-        if (!postAtualizado) {
+        if (postAtualizado) {
             return res.status(404).json(erros.POST_NAO_ENCONTRADO);
         }

[NoCoverage] BlockStatement
src/controllers/post.controller.js:50:19
         }
         res.status(200).json(postAtualizado);
     }
-    catch (error) {
-        console.error('Erro ao atualizar post:', error.message);
-        res.status(500).json(erros.POST_ERRO_ATUALIZAR);
-    }
+    catch (error) {}
 }
 

[NoCoverage] BlockStatement
src/controllers/post.controller.js:56:38
     }
 }
 
-async function deletarPost(req, res) {
-    try {
-        const { id } = req.params;
-        const postDeletado = await deletePost(id);
-        if (!postDeletado) {
-            return res.status(404).json({ message: 'Post não encontrado' });
-        }
-        res.status(200).json({ message: 'Post deletado com sucesso' });
-    } catch (error) {
-        console.error('Erro ao deletar post:', error.message);
-        res.status(500).json(erros.POST_ERRO_DELETAR);
-    }
-}
+async function deletarPost(req, res) {}
 
 async function buscarPosts(req, res) {

[NoCoverage] BlockStatement
src/controllers/post.controller.js:57:9
 }
 
 async function deletarPost(req, res) {
-    try {
-        const { id } = req.params;
-        const postDeletado = await deletePost(id);
-        if (!postDeletado) {
-            return res.status(404).json({ message: 'Post não encontrado' });
-        }
-        res.status(200).json({ message: 'Post deletado com sucesso' });
-    } catch (error) {
+    try {} catch (error) {
         console.error('Erro ao deletar post:', error.message);
         res.status(500).json(erros.POST_ERRO_DELETAR);

[NoCoverage] BooleanLiteral
src/controllers/post.controller.js:60:13
     try {
         const { id } = req.params;
         const postDeletado = await deletePost(id);
-        if (!postDeletado) {
+        if (postDeletado) {
             return res.status(404).json({ message: 'Post não encontrado' });
         }

[NoCoverage] BlockStatement
src/controllers/post.controller.js:60:28
     try {
         const { id } = req.params;
         const postDeletado = await deletePost(id);
-        if (!postDeletado) {
-            return res.status(404).json({ message: 'Post não encontrado' });
-        }
+        if (!postDeletado) {}
         res.status(200).json({ message: 'Post deletado com sucesso' });
     } catch (error) {

[NoCoverage] ObjectLiteral
src/controllers/post.controller.js:61:41
         const { id } = req.params;
         const postDeletado = await deletePost(id);
         if (!postDeletado) {
-            return res.status(404).json({ message: 'Post não encontrado' });
+            return res.status(404).json({});
         }
         res.status(200).json({ message: 'Post deletado com sucesso' });

[NoCoverage] ObjectLiteral
src/controllers/post.controller.js:63:30
         if (!postDeletado) {
             return res.status(404).json({ message: 'Post não encontrado' });
         }
-        res.status(200).json({ message: 'Post deletado com sucesso' });
+        res.status(200).json({});
     } catch (error) {
         console.error('Erro ao deletar post:', error.message);

[NoCoverage] StringLiteral
src/controllers/post.controller.js:63:41
         if (!postDeletado) {
             return res.status(404).json({ message: 'Post não encontrado' });
         }
-        res.status(200).json({ message: 'Post deletado com sucesso' });
+        res.status(200).json({ message: "" });
     } catch (error) {
         console.error('Erro ao deletar post:', error.message);

[NoCoverage] BlockStatement
src/controllers/post.controller.js:64:21
             return res.status(404).json({ message: 'Post não encontrado' });
         }
         res.status(200).json({ message: 'Post deletado com sucesso' });
-    } catch (error) {
-        console.error('Erro ao deletar post:', error.message);
-        res.status(500).json(erros.POST_ERRO_DELETAR);
-    }
+    } catch (error) {}
 }
 

[NoCoverage] StringLiteral
src/controllers/post.controller.js:65:23
         }
         res.status(200).json({ message: 'Post deletado com sucesso' });
     } catch (error) {
-        console.error('Erro ao deletar post:', error.message);
+        console.error("", error.message);
         res.status(500).json(erros.POST_ERRO_DELETAR);
     }

[NoCoverage] BlockStatement
src/controllers/post.controller.js:70:38
     }
 }
 
-async function buscarPosts(req, res) {
-    try {
-        const { query } = req.query;
-
-        if (!query) {
-            return res.status(400).json({ message: 'Query de busca é obrigatória' });
-        }
-        const posts = await searchPosts(query);
-        res.status(200).json(posts);
-    }
-    catch (error) {
-        console.error('Erro ao buscar posts:', error.message);
-        res.status(500).json(erros.POST_ERRO_BUSCAR_QUERY);
-    }
-}
+async function buscarPosts(req, res) {}
 
 module.exports = {

[NoCoverage] BlockStatement
src/controllers/post.controller.js:71:9
 }
 
 async function buscarPosts(req, res) {
-    try {
-        const { query } = req.query;
-
-        if (!query) {
-            return res.status(400).json({ message: 'Query de busca é obrigatória' });
-        }
-        const posts = await searchPosts(query);
-        res.status(200).json(posts);
-    }
+    try {}
     catch (error) {
         console.error('Erro ao buscar posts:', error.message);

[NoCoverage] BooleanLiteral
src/controllers/post.controller.js:74:13
     try {
         const { query } = req.query;
 
-        if (!query) {
+        if (query) {
             return res.status(400).json({ message: 'Query de busca é obrigatória' });
         }

[NoCoverage] BlockStatement
src/controllers/post.controller.js:74:21
     try {
         const { query } = req.query;
 
-        if (!query) {
-            return res.status(400).json({ message: 'Query de busca é obrigatória' });
-        }
+        if (!query) {}
         const posts = await searchPosts(query);
         res.status(200).json(posts);

[NoCoverage] BlockStatement
src/controllers/post.controller.js:80:19
         const posts = await searchPosts(query);
         res.status(200).json(posts);
     }
-    catch (error) {
-        console.error('Erro ao buscar posts:', error.message);
-        res.status(500).json(erros.POST_ERRO_BUSCAR_QUERY);
-    }
+    catch (error) {}
 }
 

[NoCoverage] ObjectLiteral
src/controllers/post.controller.js:86:18
     }
 }
 
-module.exports = {
-    listarPosts,
-    criarPost,
-    atualizarPost,
-    deletarPost,
-    buscarPosts,
-    listarPostPorId
-};
+module.exports = {};
