[NoCoverage] StringLiteral
src/metrics/prometheusMetrics.js:7:11
 collectDefaultMetrics();
 
 const httpRequestCounter = new client.Counter({
-    name: 'http_requests_total',
+    name: "",
     help: 'Total de requisições HTTP',
     labelNames: ['method', 'route', 'status'],

[NoCoverage] ArrayDeclaration
src/metrics/prometheusMetrics.js:9:17
 const httpRequestCounter = new client.Counter({
     name: 'http_requests_total',
     help: 'Total de requisições HTTP',
-    labelNames: ['method', 'route', 'status'],
+    labelNames: [],
 });
 

[NoCoverage] StringLiteral
src/metrics/prometheusMetrics.js:9:18
 const httpRequestCounter = new client.Counter({
     name: 'http_requests_total',
     help: 'Total de requisições HTTP',
-    labelNames: ['method', 'route', 'status'],
+    labelNames: ["", 'route', 'status'],
 });
 

[NoCoverage] BlockStatement
src/metrics/prometheusMetrics.js:12:43
     labelNames: ['method', 'route', 'status'],
 });
 
-function contarRequisicao(req, res, next) {
-    res.on('finish', () => {
-      httpRequestCounter.labels(req.method, req.path, res.statusCode).inc();
-    });
-    next();
-}
+function contarRequisicao(req, res, next) {}
 
 module.exports = {

[NoCoverage] BlockStatement
src/metrics/prometheusMetrics.js:13:28
 });
 
 function contarRequisicao(req, res, next) {
-    res.on('finish', () => {
-      httpRequestCounter.labels(req.method, req.path, res.statusCode).inc();
-    });
+    res.on('finish', () => {});
     next();
 }
