[NoCoverage] ObjectLiteral
src/models/user.model.js:3:40
 const mongoose = require('mongoose');
 
-const userSchema = new mongoose.Schema({
-    nome: { type: String, required: true },
-    email: { type: String, required: true, unique: true },
-    senha: { type: String, required: true },
-    perfil: { type: String, enum: ['admin', 'professor', 'reitor'], required: true },
-    criadoEm: { type: Date, default: Date.now },
-},
+const userSchema = new mongoose.Schema({},
     {
         timestamps: { createdAt: 'criadoEm', updatedAt: 'atualizadoEm' }

[NoCoverage] BooleanLiteral
src/models/user.model.js:4:37
 const mongoose = require('mongoose');
 
 const userSchema = new mongoose.Schema({
-    nome: { type: String, required: true },
+    nome: { type: String, required: false },
     email: { type: String, required: true, unique: true },
     senha: { type: String, required: true },

[NoCoverage] BooleanLiteral
src/models/user.model.js:5:52
 
 const userSchema = new mongoose.Schema({
     nome: { type: String, required: true },
-    email: { type: String, required: true, unique: true },
+    email: { type: String, required: true, unique: false },
     senha: { type: String, required: true },
     perfil: { type: String, enum: ['admin', 'professor', 'reitor'], required: true },

[NoCoverage] BooleanLiteral
src/models/user.model.js:5:38
 
 const userSchema = new mongoose.Schema({
     nome: { type: String, required: true },
-    email: { type: String, required: true, unique: true },
+    email: { type: String, required: false, unique: true },
     senha: { type: String, required: true },
     perfil: { type: String, enum: ['admin', 'professor', 'reitor'], required: true },

[NoCoverage] BooleanLiteral
src/models/user.model.js:6:38
 const userSchema = new mongoose.Schema({
     nome: { type: String, required: true },
     email: { type: String, required: true, unique: true },
-    senha: { type: String, required: true },
+    senha: { type: String, required: false },
     perfil: { type: String, enum: ['admin', 'professor', 'reitor'], required: true },
     criadoEm: { type: Date, default: Date.now },

[NoCoverage] BooleanLiteral
src/models/user.model.js:7:79
     nome: { type: String, required: true },
     email: { type: String, required: true, unique: true },
     senha: { type: String, required: true },
-    perfil: { type: String, enum: ['admin', 'professor', 'reitor'], required: true },
+    perfil: { type: String, enum: ['admin', 'professor', 'reitor'], required: false },
     criadoEm: { type: Date, default: Date.now },
 },

[NoCoverage] StringLiteral
src/models/user.model.js:7:58
     nome: { type: String, required: true },
     email: { type: String, required: true, unique: true },
     senha: { type: String, required: true },
-    perfil: { type: String, enum: ['admin', 'professor', 'reitor'], required: true },
+    perfil: { type: String, enum: ['admin', 'professor', ""], required: true },
     criadoEm: { type: Date, default: Date.now },
 },

[NoCoverage] StringLiteral
src/models/user.model.js:13:29
     {
         timestamps: { createdAt: 'criadoEm', updatedAt: 'atualizadoEm' }
     });
-const User = mongoose.model('User', userSchema);
+const User = mongoose.model("", userSchema);
 
 module.exports = User;
