[NoCoverage] StringLiteral
src/routes/post.routes.js:153:15
  *       404:
  *         description: Post não encontrado
  */
-router.delete('/posts/:id', autenticarToken,deletarPost);
+router.delete("", autenticarToken,deletarPost);
 
 
