[NoCoverage] BlockStatement
src/services/post.service.js:4:30
 const Post = require('../models/post.model');
 const mongoose = require('mongoose');
 
-async function getPostId(id) {
-    try {
-        const objectId = new mongoose.Types.ObjectId(id);
-        const post = await Post.findById(objectId);
-        return post;
-    }
-catch (error) {
-        console.error('Erro ao buscar post por ID: ' + error.message);
-        throw error;
-    }
-}
+async function getPostId(id) {}
 
 async function getAllPosts() {

[NoCoverage] BlockStatement
src/services/post.service.js:5:9
 const mongoose = require('mongoose');
 
 async function getPostId(id) {
-    try {
-        const objectId = new mongoose.Types.ObjectId(id);
-        const post = await Post.findById(objectId);
-        return post;
-    }
+    try {}
 catch (error) {
         console.error('Erro ao buscar post por ID: ' + error.message);

[NoCoverage] BlockStatement
src/services/post.service.js:10:15
         const post = await Post.findById(objectId);
         return post;
     }
-catch (error) {
-        console.error('Erro ao buscar post por ID: ' + error.message);
-        throw error;
-    }
+catch (error) {}
 }
 

[Killed] BlockStatement
src/services/post.service.js:16:30
     }
 }
 
-async function getAllPosts() {
-    try {
-        const posts = await Post.find().sort({ criadoEm: -1 });
-        return posts;
-    }
-    catch (error) {
-        console.error('Erro ao buscar posts:' + error.message);
-        throw error;
-    }
-}
+async function getAllPosts() {}
 
 async function createPost(dadosPost) {
killedBy: Post Service getAllPosts deve retornar uma lista de posts
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
src/services/post.service.js:17:9
 }
 
 async function getAllPosts() {
-    try {
-        const posts = await Post.find().sort({ criadoEm: -1 });
-        return posts;
-    }
+    try {}
     catch (error) {
         console.error('Erro ao buscar posts:' + error.message);
killedBy: Post Service getAllPosts deve retornar uma lista de posts
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] MethodExpression
src/services/post.service.js:18:29
 
 async function getAllPosts() {
     try {
-        const posts = await Post.find().sort({ criadoEm: -1 });
+        const posts = await Post.find();
         return posts;
     }
killedBy: Post Service getAllPosts deve retornar uma lista de posts
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [{"titulo": "Post 1"}, {"titulo": "Post 2"}]
Received: {"sort": [Function mockConstructor]}

[Survived] UnaryOperator
src/services/post.service.js:18:58
 
 async function getAllPosts() {
     try {
-        const posts = await Post.find().sort({ criadoEm: -1 });
+        const posts = await Post.find().sort({ criadoEm: +1 });
         return posts;
     }

[NoCoverage] BlockStatement
src/services/post.service.js:21:19
         const posts = await Post.find().sort({ criadoEm: -1 });
         return posts;
     }
-    catch (error) {
-        console.error('Erro ao buscar posts:' + error.message);
-        throw error;
-    }
+    catch (error) {}
 }
 

[Killed] BlockStatement
src/services/post.service.js:27:38
     }
 }
 
-async function createPost(dadosPost) {
-    try {
-        const post = await Post.create(dadosPost);
-        return post;
-    }
-    catch (error) {
-        console.error('Erro ao criar post:' + error.message);
-        throw error;
-    }
-}
+async function createPost(dadosPost) {}
 
 async function updatePost(id, dadosAtualizados) {
killedBy: Post Service PostService - createPost deve criar um novo post com sucesso
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"autor": "Fagner", "conteudo": "Conteúdo do post", "titulo": "Novo Post"}

Number of calls: 0

[Killed] BlockStatement
src/services/post.service.js:28:9
 }
 
 async function createPost(dadosPost) {
-    try {
-        const post = await Post.create(dadosPost);
-        return post;
-    }
+    try {}
     catch (error) {
         console.error('Erro ao criar post:' + error.message);
killedBy: Post Service PostService - createPost deve criar um novo post com sucesso
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"autor": "Fagner", "conteudo": "Conteúdo do post", "titulo": "Novo Post"}

Number of calls: 0

[Killed] BlockStatement
src/services/post.service.js:32:19
         const post = await Post.create(dadosPost);
         return post;
     }
-    catch (error) {
-        console.error('Erro ao criar post:' + error.message);
-        throw error;
-    }
+    catch (error) {}
 }
 
killedBy: Post Service PostService - createPost deve lançar erro ao tentar criar post
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] BlockStatement
src/services/post.service.js:38:49
     }
 }
 
-async function updatePost(id, dadosAtualizados) {
-    try {
-        const objectId = new mongoose.Types.ObjectId(id);
-        const post = await Post.findByIdAndUpdate(
-            objectId,
-            {
-                ...dadosAtualizados,
-                atualizadoEm: new Date(),
-            },
-            { new: true }
-        );
-
-        return post;
-    } catch (error) {
-        console.error('Erro ao atualizar post: ' + error.message);
-        throw error;
-    }
-}
+async function updatePost(id, dadosAtualizados) {}
 
 async function deletePost(id) {
killedBy: Post Service PostService - updatePost deve atualizar um post com sucesso
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
src/services/post.service.js:39:9
 }
 
 async function updatePost(id, dadosAtualizados) {
-    try {
-        const objectId = new mongoose.Types.ObjectId(id);
-        const post = await Post.findByIdAndUpdate(
-            objectId,
-            {
-                ...dadosAtualizados,
-                atualizadoEm: new Date(),
-            },
-            { new: true }
-        );
-
-        return post;
-    } catch (error) {
+    try {} catch (error) {
         console.error('Erro ao atualizar post: ' + error.message);
         throw error;
killedBy: Post Service PostService - updatePost deve atualizar um post com sucesso
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Survived] ObjectLiteral
src/services/post.service.js:43:13
         const objectId = new mongoose.Types.ObjectId(id);
         const post = await Post.findByIdAndUpdate(
             objectId,
-            {
-                ...dadosAtualizados,
-                atualizadoEm: new Date(),
-            },
+            {},
             { new: true }
         );

[Killed] BlockStatement
src/services/post.service.js:51:21
         );
 
         return post;
-    } catch (error) {
-        console.error('Erro ao atualizar post: ' + error.message);
-        throw error;
-    }
+    } catch (error) {}
 }
 
killedBy: Post Service PostService - updatePost deve lançar erro ao tentar atualizar
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Survived] StringLiteral
src/services/post.service.js:52:23
 
         return post;
     } catch (error) {
-        console.error('Erro ao atualizar post: ' + error.message);
+        console.error("" + error.message);
         throw error;
     }

[Killed] BlockStatement
src/services/post.service.js:57:31
     }
 }
 
-async function deletePost(id) {
-    const objectId = new mongoose.Types.ObjectId(id);
-    try {
-        const post = await Post.findByIdAndDelete(objectId);
-        return post;
-    }
-    catch (error) {
-        console.error('Erro ao deletar post:' + error.message);
-        throw error;
-    }
-}
+async function deletePost(id) {}
 
 async function searchPosts(termo){
killedBy: Post Service PostService - deletePost deve deletar um post com sucesso
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: Any<Object>

Number of calls: 0

[Killed] BlockStatement
src/services/post.service.js:59:9
 
 async function deletePost(id) {
     const objectId = new mongoose.Types.ObjectId(id);
-    try {
-        const post = await Post.findByIdAndDelete(objectId);
-        return post;
-    }
+    try {}
     catch (error) {
         console.error('Erro ao deletar post:' + error.message);
killedBy: Post Service PostService - deletePost deve deletar um post com sucesso
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: Any<Object>

Number of calls: 0

[Killed] BlockStatement
src/services/post.service.js:63:19
         const post = await Post.findByIdAndDelete(objectId);
         return post;
     }
-    catch (error) {
-        console.error('Erro ao deletar post:' + error.message);
-        throw error;
-    }
+    catch (error) {}
 }
 
killedBy: Post Service PostService - deletePost deve lançar erro ao tentar deletar post
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[NoCoverage] BlockStatement
src/services/post.service.js:69:34
     }
 }
 
-async function searchPosts(termo){
-    try{
-        const regex = new RegExp(termo, 'i');
-        const posts = await Post.find({
-            $or: [
-                { titulo: regex },
-                { conteudo: regex }
-            ]
-        }).sort({ criadoEm: -1 });
-        return posts;
-    }
-    catch (error) {
-        console.error('Erro ao buscar posts por consulta: ' + error.message);
-        throw error;
-    }
-}
+async function searchPosts(termo){}
 
 module.exports = {

[NoCoverage] BlockStatement
src/services/post.service.js:70:8
 }
 
 async function searchPosts(termo){
-    try{
-        const regex = new RegExp(termo, 'i');
-        const posts = await Post.find({
-            $or: [
-                { titulo: regex },
-                { conteudo: regex }
-            ]
-        }).sort({ criadoEm: -1 });
-        return posts;
-    }
+    try{}
     catch (error) {
         console.error('Erro ao buscar posts por consulta: ' + error.message);

[NoCoverage] MethodExpression
src/services/post.service.js:72:29
 async function searchPosts(termo){
     try{
         const regex = new RegExp(termo, 'i');
-        const posts = await Post.find({
-            $or: [
-                { titulo: regex },
-                { conteudo: regex }
-            ]
-        }).sort({ criadoEm: -1 });
+        const posts = await Post.find({
+  $or: [{
+    titulo: regex
+  }, {
+    conteudo: regex
+  }]
+});
         return posts;
     }

[NoCoverage] ObjectLiteral
src/services/post.service.js:72:39
 async function searchPosts(termo){
     try{
         const regex = new RegExp(termo, 'i');
-        const posts = await Post.find({
-            $or: [
-                { titulo: regex },
-                { conteudo: regex }
-            ]
-        }).sort({ criadoEm: -1 });
+        const posts = await Post.find({}).sort({ criadoEm: -1 });
         return posts;
     }

[NoCoverage] UnaryOperator
src/services/post.service.js:77:29
                 { titulo: regex },
                 { conteudo: regex }
             ]
-        }).sort({ criadoEm: -1 });
+        }).sort({ criadoEm: +1 });
         return posts;
     }

[NoCoverage] BlockStatement
src/services/post.service.js:80:19
         }).sort({ criadoEm: -1 });
         return posts;
     }
-    catch (error) {
-        console.error('Erro ao buscar posts por consulta: ' + error.message);
-        throw error;
-    }
+    catch (error) {}
 }
 

[NoCoverage] StringLiteral
src/services/post.service.js:81:23
         return posts;
     }
     catch (error) {
-        console.error('Erro ao buscar posts por consulta: ' + error.message);
+        console.error("" + error.message);
         throw error;
     }
