[NoCoverage] StringLiteral
src/utils/errors.js:3:28
 module.exports = {
   // Auth
-  EMAIL_DUPLICADO: { code: 'ERROR01', message: 'E-mail já cadastrado.' },
+  EMAIL_DUPLICADO: { code: "", message: 'E-mail já cadastrado.' },
   CAMPOS_OBRIGATORIOS: { code: 'ERROR02', message: 'Todos os campos são obrigatórios.' },
   LOGIN_INVALIDO: { code: 'ERROR03', message: 'Usuário ou senha inválidos.' },

[NoCoverage] StringLiteral
src/utils/errors.js:3:48
 module.exports = {
   // Auth
-  EMAIL_DUPLICADO: { code: 'ERROR01', message: 'E-mail já cadastrado.' },
+  EMAIL_DUPLICADO: { code: 'ERROR01', message: "" },
   CAMPOS_OBRIGATORIOS: { code: 'ERROR02', message: 'Todos os campos são obrigatórios.' },
   LOGIN_INVALIDO: { code: 'ERROR03', message: 'Usuário ou senha inválidos.' },

[NoCoverage] StringLiteral
src/utils/errors.js:4:52
 module.exports = {
   // Auth
   EMAIL_DUPLICADO: { code: 'ERROR01', message: 'E-mail já cadastrado.' },
-  CAMPOS_OBRIGATORIOS: { code: 'ERROR02', message: 'Todos os campos são obrigatórios.' },
+  CAMPOS_OBRIGATORIOS: { code: 'ERROR02', message: "" },
   LOGIN_INVALIDO: { code: 'ERROR03', message: 'Usuário ou senha inválidos.' },
   USUARIO_NAO_ENCONTRADO: { code: 'ERROR04', message: 'Usuário não encontrado.' },

[NoCoverage] ObjectLiteral
src/utils/errors.js:5:19
   // Auth
   EMAIL_DUPLICADO: { code: 'ERROR01', message: 'E-mail já cadastrado.' },
   CAMPOS_OBRIGATORIOS: { code: 'ERROR02', message: 'Todos os campos são obrigatórios.' },
-  LOGIN_INVALIDO: { code: 'ERROR03', message: 'Usuário ou senha inválidos.' },
+  LOGIN_INVALIDO: {},
   USUARIO_NAO_ENCONTRADO: { code: 'ERROR04', message: 'Usuário não encontrado.' },
   ERRO_INTERNO: { code: 'ERROR99', message: 'Erro interno no servidor.' },

[NoCoverage] StringLiteral
src/utils/errors.js:5:47
   // Auth
   EMAIL_DUPLICADO: { code: 'ERROR01', message: 'E-mail já cadastrado.' },
   CAMPOS_OBRIGATORIOS: { code: 'ERROR02', message: 'Todos os campos são obrigatórios.' },
-  LOGIN_INVALIDO: { code: 'ERROR03', message: 'Usuário ou senha inválidos.' },
+  LOGIN_INVALIDO: { code: 'ERROR03', message: "" },
   USUARIO_NAO_ENCONTRADO: { code: 'ERROR04', message: 'Usuário não encontrado.' },
   ERRO_INTERNO: { code: 'ERROR99', message: 'Erro interno no servidor.' },

[NoCoverage] StringLiteral
src/utils/errors.js:6:55
   EMAIL_DUPLICADO: { code: 'ERROR01', message: 'E-mail já cadastrado.' },
   CAMPOS_OBRIGATORIOS: { code: 'ERROR02', message: 'Todos os campos são obrigatórios.' },
   LOGIN_INVALIDO: { code: 'ERROR03', message: 'Usuário ou senha inválidos.' },
-  USUARIO_NAO_ENCONTRADO: { code: 'ERROR04', message: 'Usuário não encontrado.' },
+  USUARIO_NAO_ENCONTRADO: { code: 'ERROR04', message: "" },
   ERRO_INTERNO: { code: 'ERROR99', message: 'Erro interno no servidor.' },
 

[NoCoverage] StringLiteral
src/utils/errors.js:7:45
   CAMPOS_OBRIGATORIOS: { code: 'ERROR02', message: 'Todos os campos são obrigatórios.' },
   LOGIN_INVALIDO: { code: 'ERROR03', message: 'Usuário ou senha inválidos.' },
   USUARIO_NAO_ENCONTRADO: { code: 'ERROR04', message: 'Usuário não encontrado.' },
-  ERRO_INTERNO: { code: 'ERROR99', message: 'Erro interno no servidor.' },
+  ERRO_INTERNO: { code: 'ERROR99', message: "" },
 
 

[NoCoverage] StringLiteral
src/utils/errors.js:12:48
 
   // Post
   POST_NAO_ENCONTRADO: { code: 'POST01', message: 'Post não encontrado.' },
-  POST_ERRO_BUSCAR: { code: 'POST02', message: 'Erro ao buscar post.' },
+  POST_ERRO_BUSCAR: { code: 'POST02', message: "" },
   POST_ERRO_LISTAR: { code: 'POST03', message: 'Erro ao buscar posts.' },
   POST_ERRO_CRIAR: { code: 'POST04', message: 'Erro ao criar post.' },

[NoCoverage] StringLiteral
src/utils/errors.js:14:47
   POST_NAO_ENCONTRADO: { code: 'POST01', message: 'Post não encontrado.' },
   POST_ERRO_BUSCAR: { code: 'POST02', message: 'Erro ao buscar post.' },
   POST_ERRO_LISTAR: { code: 'POST03', message: 'Erro ao buscar posts.' },
-  POST_ERRO_CRIAR: { code: 'POST04', message: 'Erro ao criar post.' },
+  POST_ERRO_CRIAR: { code: 'POST04', message: "" },
   POST_ERRO_ATUALIZAR: { code: 'POST05', message: 'Erro ao atualizar post.' },
   POST_ERRO_DELETAR: { code: 'POST06', message: 'Erro ao deletar post.' },

[NoCoverage] StringLiteral
src/utils/errors.js:16:49
   POST_ERRO_LISTAR: { code: 'POST03', message: 'Erro ao buscar posts.' },
   POST_ERRO_CRIAR: { code: 'POST04', message: 'Erro ao criar post.' },
   POST_ERRO_ATUALIZAR: { code: 'POST05', message: 'Erro ao atualizar post.' },
-  POST_ERRO_DELETAR: { code: 'POST06', message: 'Erro ao deletar post.' },
+  POST_ERRO_DELETAR: { code: 'POST06', message: "" },
   POST_QUERY_OBRIGATORIA: { code: 'POST07', message: 'Query de busca é obrigatória.' },
   POST_ERRO_BUSCAR_QUERY: { code: 'POST08', message: 'Erro ao buscar posts com query.' },

[NoCoverage] ObjectLiteral
src/utils/errors.js:17:27
   POST_ERRO_CRIAR: { code: 'POST04', message: 'Erro ao criar post.' },
   POST_ERRO_ATUALIZAR: { code: 'POST05', message: 'Erro ao atualizar post.' },
   POST_ERRO_DELETAR: { code: 'POST06', message: 'Erro ao deletar post.' },
-  POST_QUERY_OBRIGATORIA: { code: 'POST07', message: 'Query de busca é obrigatória.' },
+  POST_QUERY_OBRIGATORIA: {},
   POST_ERRO_BUSCAR_QUERY: { code: 'POST08', message: 'Erro ao buscar posts com query.' },
 

[NoCoverage] StringLiteral
src/utils/errors.js:18:54
   POST_ERRO_ATUALIZAR: { code: 'POST05', message: 'Erro ao atualizar post.' },
   POST_ERRO_DELETAR: { code: 'POST06', message: 'Erro ao deletar post.' },
   POST_QUERY_OBRIGATORIA: { code: 'POST07', message: 'Query de busca é obrigatória.' },
-  POST_ERRO_BUSCAR_QUERY: { code: 'POST08', message: 'Erro ao buscar posts com query.' },
+  POST_ERRO_BUSCAR_QUERY: { code: 'POST08', message: "" },
 
   // Genericos

[NoCoverage] StringLiteral
src/utils/errors.js:18:35
   POST_ERRO_ATUALIZAR: { code: 'POST05', message: 'Erro ao atualizar post.' },
   POST_ERRO_DELETAR: { code: 'POST06', message: 'Erro ao deletar post.' },
   POST_QUERY_OBRIGATORIA: { code: 'POST07', message: 'Query de busca é obrigatória.' },
-  POST_ERRO_BUSCAR_QUERY: { code: 'POST08', message: 'Erro ao buscar posts com query.' },
+  POST_ERRO_BUSCAR_QUERY: { code: "", message: 'Erro ao buscar posts com query.' },
 
   // Genericos

[NoCoverage] StringLiteral
src/utils/errors.js:21:45
   POST_ERRO_BUSCAR_QUERY: { code: 'POST08', message: 'Erro ao buscar posts com query.' },
 
   // Genericos
-  ERRO_INTERNO: { code: 'ERROR99', message: 'Erro interno no servidor.' },
+  ERRO_INTERNO: { code: 'ERROR99', message: "" },
 
   // Token

[NoCoverage] StringLiteral
src/utils/errors.js:21:25
   POST_ERRO_BUSCAR_QUERY: { code: 'POST08', message: 'Erro ao buscar posts com query.' },
 
   // Genericos
-  ERRO_INTERNO: { code: 'ERROR99', message: 'Erro interno no servidor.' },
+  ERRO_INTERNO: { code: "", message: 'Erro interno no servidor.' },
 
   // Token

[NoCoverage] ObjectLiteral
src/utils/errors.js:24:24
   ERRO_INTERNO: { code: 'ERROR99', message: 'Erro interno no servidor.' },
 
   // Token
-  TOKEN_NAO_FORNECIDO: { code: 'AUTH01', message: 'Token de autenticação não fornecido' },
+  TOKEN_NAO_FORNECIDO: {},
   TOKEN_INVALIDO: { code: 'AUTH02', message: 'Token inválido ou expirado' },
 };

[NoCoverage] StringLiteral
src/utils/errors.js:25:27
 
   // Token
   TOKEN_NAO_FORNECIDO: { code: 'AUTH01', message: 'Token de autenticação não fornecido' },
-  TOKEN_INVALIDO: { code: 'AUTH02', message: 'Token inválido ou expirado' },
+  TOKEN_INVALIDO: { code: "", message: 'Token inválido ou expirado' },
 };
