[Survived] BooleanLiteral
src/models/post.model.js:4:37
 const mongoose = require('mongoose');
 
 const postSchema = new mongoose.Schema({
-  titulo: { type: String, required: true },
+  titulo: { type: String, required: false },
   conteudo: { type: String, required: true },
   autor: { type: String, required: true },

[Survived] ObjectLiteral
src/models/post.model.js:4:11
 const mongoose = require('mongoose');
 
 const postSchema = new mongoose.Schema({
-  titulo: { type: String, required: true },
+  titulo: {},
   conteudo: { type: String, required: true },
   autor: { type: String, required: true },

[Survived] BooleanLiteral
src/models/post.model.js:5:39
 
 const postSchema = new mongoose.Schema({
   titulo: { type: String, required: true },
-  conteudo: { type: String, required: true },
+  conteudo: { type: String, required: false },
   autor: { type: String, required: true },
   status: { type: String, enum: ['ativo', 'inativo'], default: 'ativo' },

[Survived] BooleanLiteral
src/models/post.model.js:6:36
 const postSchema = new mongoose.Schema({
   titulo: { type: String, required: true },
   conteudo: { type: String, required: true },
-  autor: { type: String, required: true },
+  autor: { type: String, required: false },
   status: { type: String, enum: ['ativo', 'inativo'], default: 'ativo' },
 },

[Survived] ObjectLiteral
src/models/post.model.js:6:10
 const postSchema = new mongoose.Schema({
   titulo: { type: String, required: true },
   conteudo: { type: String, required: true },
-  autor: { type: String, required: true },
+  autor: {},
   status: { type: String, enum: ['ativo', 'inativo'], default: 'ativo' },
 },

[Survived] ObjectLiteral
src/models/post.model.js:7:11
   titulo: { type: String, required: true },
   conteudo: { type: String, required: true },
   autor: { type: String, required: true },
-  status: { type: String, enum: ['ativo', 'inativo'], default: 'ativo' },
+  status: {},
 },
   {

[Survived] ObjectLiteral
src/models/post.model.js:10:17
   status: { type: String, enum: ['ativo', 'inativo'], default: 'ativo' },
 },
   {
-    timestamps: { createdAt: 'criadoEm', updatedAt: 'atualizadoEm' }
+    timestamps: {}
   });
 
